package Homework;
//Задание 3
//Создать интерфейс light с методом гореть. Реализовать использование этого интерфейса в двух классах костер
// и лампочка. При обращении к определенному объекту должно быть выведено сообщение горит этот объект или нет,
// если да, его можно потушить, если нет, его можно зажечь. Реализовать класс лампа, который будет иметь
// возможность включаться и выключаться, но если он включен, то должно выводиться сообщение каким цветом горит
// эта лампа. Цвет поступает из консоли(сами вводим).
public interface Light {
    public static void ligth() {





    }


}
